_org_posts/_posts/2021-11-13-boj-10812.org
#+HTML: ---
#+HTML: title: BOJ 10822 바구니 순서 바꾸기
#+HTML: tags: STL
#+HTML: ---
#+OPTIONS: ^:nil

** BOJ 10822 바구니 순서 바꾸기

** 접근하기
- begin, begin + 1, ... , mid -1 , mid, ... , end-1, end
- mid, mid+1, ..., end-1, end, begin, begin+1, mid-1 로 변경
- 뒷부분을 앞으로 가져오고, 앞부분을 뒤로 보냄

** 코드 - 배열로 풀기
#+BEGIN_SRC cpp
#include <stdio.h>

int N, M;
int a[101];
int temp[101];

int main(int argc, char* argv[])
{
    scanf("%d %d", &N, &M);
    for(int i=1;i<=N;i++) {
        a[i] = i;
    } 

    int left, right, mid;
    for(int i=0;i<M;i++) {
        scanf("%d %d %d", &left, &right, &mid);
        
        int k = 1;
        for(int j=mid;j<=right;j++) {
            temp[k++] = a[j];
        }
        for(int j=left;j<mid;j++) {
            temp[k++] = a[j];
        }
        
        for(int j=left, x=1;j<=right;j++) {
            a[j] = temp[x++];
        }
    }

    for(int i=1;i<=N;i++) {
        printf("%d ", a[i]);
    }
    printf("\n");
    return 0;
}
#+END_SRC

** 코드 - STL rotate로 풀기
- vector 생성자에서 N을 주면, 배열처럼 사용
- std::rotate로 바꿈
- 오른쪽으로 회전
#+BEGIN_SRC cpp
#include <cstdio>
#include <vector>
#include <algorithm>
using namespace std;

int main(int argc, char* argv[])
{
    int N, M;
    scanf("%d %d", &N, &M);
    vector <int> v(N); 
    
    for(int i=1;i<=N;i++) {
        v[i-1] = i;
    }
    for(int i=0;i<M;i++) {
        int left, right, mid;
        scanf("%d %d %d", &left, &right, &mid);
        rotate(v.begin() + (left-1) , v.begin() + (mid-1), v.begin() + right); 
    }

    for(auto e :v) {
        printf("%d ", e);
    }
    printf("\n");
    return 0;
}
#+END_SRC

** 문제 링크
- https://www.acmicpc.net/problem/10812
